#  Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 

# a = (input('Введите трехзначное число: '))
# b = int (a[0])
# c = int (a[1])
# d = int (a[2])

# result = (b+c+d)
# print (result)

# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

# s = int (input('Введите общее число журавликов: '))
# if not s % 6:
#     x = s//6
# print (f'Катя сделала {x *4} корабликов')
# print (f'Петя сделала {x } корабликов')
# print (f'Сережа сделала {x} корабликов')
